info={
"Department":["教育学部", "经济与管理学部", "人文社会科学学院", "外语学院", "传播学院", "国际汉语文化学院", "心理与认知科学学院", "体育与健康学院", "马克思主义学院", "政治与国际关系学院", "社会发展学院", "数学科学学院", "物理与电子科学学院", "化学与分子工程学院", "生命科学学院", "地理科学学院", "生态与环境科学学院", "计算机科学与技术学院", "软件工程学院", "数据科学与工程学院", "通信与电子工程学院", "空间人工智能学院", "药学院", "音乐学院", "美术学院", "设计学院", "上海国际首席技术官学院", "密码学院", "城市建设学院", "电子与信息学院", "动物科学学院", "法学院", "经济与管理学院", "化学与环境工程学院", "机械工程学院", "计算机科学学院", "教育与体育学院", "农学院", "生命科学学院", "外国语学院", "人文与新媒体学院", "物理与光电工程学院", "信息与数学学院", "医学部", "艺术学院", "园艺园林学院", "第一临床医学院", "第二临床医学院", "地球物理与石油资源学院", "地球科学学院", "石油工程学院", "资源与环境学院", "传媒学院", "国际教育学院", "建筑学院", "土木水利学院", "环境学院", "车辆与运载学院", "航天航空学院", "自动化系", "集成电路学院", "人工智能学院", "材料学院", "医学院", "药学院", "临床医学院", "生物医学工程学院", "公共卫生学院", "经济管理学院", "公共管理学院", "社会科学学院", "五道口金融学院"],
"Theme":["学术讲座", "人物采访", "活动报道", "比赛纪录", "校园歌手大赛", "舞蹈表演", "话剧演出", "诗歌晚会", "绘画比赛", "篮球赛", "跑步挑战赛", "排球友谊赛", "高尔夫比赛", "健身舞比赛", "科技展览", "创业竞赛", "学术挑战赛", "学术论坛", "校庆活动", "毕业晚会", "老校友联谊会", "红色经典诵读", "非遗漆扇制作", "露天茶话会", "班级演唱会", "国际文化节", "彩虹跑活动", "抖音短视频大赛", "辩论大赛", "校园宿舍评选", "十佳寝室评选", "寝室文化节", "旧物改造大赛", "环保知识竞赛", "学术沙龙", "创意狂欢之夜", "心灵美食之旅", "探秘自然奇观", "艺术与科技的融合", "绿色环保日", "书香漫步", "音乐盛典", "美丽时尚秀", "健康生活快乐运动", "创业创新论坛", "幸福家庭大赛", "科技未来展望", "青春运动会", "美食文化之旅", "爱心义卖市集", "科学探索之旅", "梦想创业之夜", "创意文化周", "健康运动节", "环境保护日", "志愿者招募周", "艺术家展览会", "创业创新大赛", "学术研讨会", "职业规划讲座", "文化艺术节", "科技创新展", "大学生运动会", "志愿者文化交流活动", "社团文化展示", "职业技能培训", "网络安全周", "主题班会", "模拟法庭辩论", "政策分析大赛", "行业研究比赛", "数据新闻工作坊", "求职技能工作坊", "软件技能培训", "公开演讲训练营", "基础急救培训", "汽车保养知识讲座", "电子产品设计大赛", "手抄报创作活动", "非遗美食专区", "助农专区", "跳蚤市场", "文创设计大赛", "导学趣味运动会", "新生舞会", "百团大战", "校园躲猫猫", "反诈宣传推理游戏", "文明礼仪讲座", "应急基金募捐", "校园外卖调查", "月球车创意设计", "情商加油站", "考研经验分享会", "模拟面试", "简历问诊", "OFFER派对", "实验室安全知识竞赛", "软件编程马拉松", "人工智能体验营", "机器人挑战赛", "化学实验技能大赛", "建筑模型设计赛", "电路焊接竞赛", "汽车拆装大赛", "服装设计作品展", "微电影创作大赛", "摄影大赛", "校园涂鸦节", "戏剧剧本创作", "校园解说员大赛", "诗歌创作朗诵会", "校园寻宝", "趣味数学竞赛", "物理实验展示", "化学魔术秀", "生物标本制作", "天文观测活动", "地质考察", "植物挂牌认养", "校园清洁日", "爱心献血", "图书捐赠", "支教活动", "养老院慰问", "动物保护宣传", "交通协管", "图书馆整理", "运动会", "马拉松", "瑜伽体验", "武术教学", "轮滑比赛", "自行车骑行", "登山活动", "野营体验", "钓鱼比赛", "电子竞技", "桌游比赛", "棋类大赛", "魔方还原", "数独挑战", "谜题解密", "观影会", "读书分享会", "歌友会", "舞会", "联谊活动", "化妆舞会", "生日派对", "节日庆祝", "灯光秀", "烟花表演", "灯谜竞猜", "月饼制作", "包粽子比赛", "圣诞礼物交换", "新年倒计时"],
"Priority": ["普通", "加急"]
}

while True:
 D1=input("Dpartment:")
 if D1 in info["Department"]:
   D=D1
   break
 else:
   print("字段不合法，请重试")
while True:
 T1=input("Theme:")
 if T1 in info["Theme"]:
   T=T1
   break
 else:
   print("字段不合法，请重试")  
while True:
 P1=input("Priority:")
 if P1 in info["Priority"]:
   P=P1
   break
 else:
   print("字段不合法，请重试")

print(f"登记成功:\nDpartment:{D}\nTheme:{T}\nPriority:{P}")      
